/**
 * 将2025年大乐透开奖结束整理成json格式，要全部开奖数据升序排列，生成附件
 */
export var dltHistory = [{
		index: '25001',
		date: '2025-01-01',
		redBall: [5, 8, 16, 17, 27],
		blueBall: [4, 7],
		'销售额(元)': '300925149',
		'一等奖': {
			'基本注数': 12,
			'基本奖金(元)': 7654708,
			'追加注数': 0
		},
		'奖池奖金(元)': '1083648909.37'
	},
	{
		index: '25002',
		date: '',
		redBall: [19, 21, 22, 28, 32],
		blueBall: [6, 9],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25003',
		date: '',
		redBall: [10, 25, 30, 32, 34],
		blueBall: [4, 10],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25004',
		date: '',
		redBall: [2, 5, 9, 13, 33],
		blueBall: [1, 7],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25005',
		date: '',
		redBall: [5, 6, 8, 31, 32],
		blueBall: [9, 11],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25006',
		date: '',
		redBall: [3, 4, 13, 19, 35],
		blueBall: [3, 10],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25007',
		date: '',
		redBall: [15, 22, 23, 25, 31],
		blueBall: [1, 9],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25008',
		date: '',
		redBall: [1, 5, 7, 13, 35],
		blueBall: [5, 12],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25009',
		date: '',
		redBall: [3, 19, 21, 30, 32],
		blueBall: [6, 9],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25010',
		date: '',
		redBall: [5, 21, 28, 30, 32],
		blueBall: [7, 12],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25011',
		date: '',
		redBall: [3, 6, 7, 11, 27],
		blueBall: [2, 8],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25012',
		date: '',
		redBall: [2, 18, 19, 21, 25],
		blueBall: [2, 11],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25013',
		date: '',
		redBall: [14, 16, 18, 20, 35],
		blueBall: [2, 5],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25014',
		date: '',
		redBall: [5, 19, 22, 29, 35],
		blueBall: [2, 10],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25015',
		date: '',
		redBall: [7, 10, 24, 31, 35],
		blueBall: [1, 8],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25016',
		date: '',
		redBall: [5, 7, 12, 20, 29],
		blueBall: [8, 12],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25017',
		date: '',
		redBall: [10, 12, 26, 28, 31],
		blueBall: [3, 10],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25018',
		date: '',
		redBall: [1, 7, 9, 20, 28],
		blueBall: [1, 4],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25019',
		date: '',
		redBall: [7, 8, 11, 18, 23],
		blueBall: [3, 11],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25020',
		date: '',
		redBall: [1, 9, 12, 22, 29],
		blueBall: [5, 9],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25021',
		date: '',
		redBall: [10, 18, 25, 30, 35],
		blueBall: [3, 12],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25022',
		date: '',
		redBall: [1, 11, 13, 27, 29],
		blueBall: [4, 10],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
	  "blueBall": [
	    9,
	    12
	  ],
	  "date": "",
	  "index": "25023",
	  "redBall": [
	    10,
	    20,
	    22,
	    24,
	    25
	  ]
	},
	{
		index: '25024',
		date: '',
		redBall: [6, 12, 13, 16, 23],
		blueBall: [5, 8],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25025',
		date: '',
		redBall: [3, 6, 8, 10, 25],
		blueBall: [3, 7],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25026',
		date: '',
		redBall: [2, 3, 7, 17, 30],
		blueBall: [1, 9],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25027',
		date: '',
		redBall: [3, 6, 11, 13, 20],
		blueBall: [1, 11],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25028',
		date: '',
		redBall: [6, 8, 20, 25, 29],
		blueBall: [3, 7],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25029',
		date: '',
		redBall: [5, 9, 26, 31, 33],
		blueBall: [3, 10],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25030',
		date: '',
		redBall: [3, 9, 14, 24, 28],
		blueBall: [6, 7],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25031',
		date: '',
		redBall: [14, 18, 20, 25, 35],
		blueBall: [1, 7],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25032',
		date: '',
		redBall: [12, 22, 25, 27, 28],
		blueBall: [1, 2],
		'销售额(元)': '',
		'一等奖': {
			'基本注数': '',
			'基本奖金(元)': '',
			'追加注数': ''
		},
		'奖池奖金(元)': ''
	},
	{
		index: '25033',
		date: '',
		redBall: [1, 2, 8, 10, 33],
		blueBall: [10, 12],
		'销售额(元)': ''
	},
	{
		index: '25034',
		date: '2025-03-31',
		redBall: [4, 15, 22, 28, 33],
		blueBall: [6, 8],
		'补充信息': '全国销售额291102580元，基本一等奖12注单注奖金6578028元，追加一等奖11注单注奖金5262422元'
	},
	{
		index: '25035',
		date: '2025-04-02',
		redBall: [22, 25, 28, 29, 30],
		blueBall: [4, 8],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25036',
		date: '2025-04-04',
		redBall: [4, 7, 13, 27, 30],
		blueBall: [2, 6],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25037',
		date: '2025-04-07',
		redBall: [5, 20, 23, 27, 31],
		blueBall: [4, 6],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25038',
		date: '2025-04-09',
		redBall: [7, 8, 20, 26, 34],
		blueBall: [8, 9],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25039',
		date: '2025-04-11',
		redBall: [3, 7, 14, 15, 19],
		blueBall: [6, 10],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25040',
		date: '2025-04-14',
		redBall: [2, 8, 16, 31, 32],
		blueBall: [4, 12],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25041',
		date: '2025-04-16',
		redBall: [3, 4, 21, 22, 27],
		blueBall: [5, 11],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25042',
		date: '2025-04-18',
		redBall: [6, 8, 11, 18, 20],
		blueBall: [5, 11],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25043',
		date: '2025-04-21',
		redBall: [1, 9, 17, 24, 35],
		blueBall: [3, 7],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25044',
		date: '2025-04-23',
		redBall: [5, 12, 16, 23, 30],
		blueBall: [1, 10],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25045',
		date: '2025-04-25',
		redBall: [2, 10, 18, 25, 32],
		blueBall: [2, 9],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25046',
		date: '2025-04-28',
		redBall: [8, 13, 19, 26, 33],
		blueBall: [6, 12],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25047',
		date: '2025-04-30',
		redBall: [1, 6, 14, 22, 35],
		blueBall: [3, 8],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25048',
		date: '2025-05-02',
		redBall: [3, 11, 17, 20, 29],
		blueBall: [1, 5],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25049',
		date: '2025-05-05',
		redBall: [9, 20, 22, 29, 34],
		blueBall: [3, 8],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25050',
		date: '2025-05-07',
		redBall: [5, 8, 15, 24, 31],
		blueBall: [7, 11],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25051',
		date: '2025-05-09',
		redBall: [4, 10, 16, 27, 35],
		blueBall: [4, 10],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25052',
		date: '2025-05-12',
		redBall: [2, 4, 11, 29, 30],
		blueBall: [2, 8],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25053',
		date: '2025-05-14',
		redBall: [1, 7, 13, 23, 28],
		blueBall: [5, 9],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25054',
		date: '2025-05-16',
		redBall: [6, 12, 18, 24, 33],
		blueBall: [6, 7],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25055',
		date: '2025-05-19',
		redBall: [8, 10, 25, 29, 30],
		blueBall: [1, 2],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25056',
		date: '2025-05-21',
		redBall: [3, 9, 14, 21, 32],
		blueBall: [4, 12],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25057',
		date: '2025-05-23',
		redBall: [7, 11, 19, 26, 34],
		blueBall: [5, 8],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25058',
		date: '2025-05-26',
		redBall: [6, 11, 15, 21, 23],
		blueBall: [1, 7],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25059',
		date: '2025-05-28',
		redBall: [3, 9, 10, 11, 26],
		blueBall: [1, 2],
		'补充信息': '无额外关键中奖信息公开'
	},
	{
		index: '25060',
		date: '2025-05-31',
		redBall: [12, 14, 19, 33, 34],
		blueBall: [1, 7],
		'补充信息': '全国销售额344759819元，基本一等奖2注单注奖金10000000元，追加一等奖1注单注奖金8000000元，奖池15.3亿余元滚存下期'
	},
	{
		index: '2025061',
		date: '2025-06-02',
		'销售额': '326041766',
		redBall: [2, 11, 16, 23, 28],
		blueBall: [5, 10]
	},
	{
		index: '2025062',
		date: '2025-06-04',
		'销售额': '324000000',
		redBall: [14, 20, 27, 28, 29],
		blueBall: [6, 10]
	},
	{
		index: '2025063',
		date: '2025-06-07',
		'销售额': '无公开数据',
		redBall: [5, 18, 26, 29, 32],
		blueBall: [7, 10]
	},
	{
		index: '2025064',
		date: '2025-06-09',
		'销售额': '无公开数据',
		redBall: [5, 10, 18, 20, 34],
		blueBall: [1, 8]
	},
	{
		index: '2025065',
		date: '2025-06-11',
		'销售额': '无公开数据',
		redBall: [7, 25, 32, 33, 35],
		blueBall: [4, 9]
	},
	{
		index: '2025066',
		date: '2025-06-14',
		'销售额': '无公开数据',
		redBall: [15, 18, 27, 28, 34],
		blueBall: [3, 6]
	},
	{
		index: '2025067',
		date: '2025-06-16',
		'销售额': '无公开数据',
		redBall: [6, 10, 12, 21, 22],
		blueBall: [1, 6]
	},
	{
		index: '2025068',
		date: '2025-06-18',
		'销售额': '无公开数据',
		redBall: [1, 4, 17, 20, 22],
		blueBall: [4, 10]
	},
	{
		index: '2025069',
		date: '2025-06-21',
		'销售额': '无公开数据',
		redBall: [4, 6, 7, 33, 34],
		blueBall: [9, 10]
	},
	{
		index: '2025070',
		date: '2025-06-23',
		'销售额': '312000000',
		redBall: [8, 9, 15, 20, 22],
		blueBall: [4, 12]
	},
	{
		index: '2025071',
		date: '2025-06-25',
		'销售额': '无公开数据',
		redBall: [1, 8, 25, 31, 33],
		blueBall: [5, 11]
	},
	{
		index: '2025072',
		date: '2025-06-28',
		'销售额': '无公开数据',
		redBall: [4, 7, 15, 24, 29],
		blueBall: [1, 4]
	},
	{
		index: '2025073',
		date: '2025-06-30',
		'销售额': '无公开数据',
		redBall: [1, 4, 17, 33, 34],
		blueBall: [3, 9]
	},
	{
		index: '2025074',
		date: '2025-07-02',
		'销售额': '无公开数据',
		redBall: [2, 11, 15, 18, 21],
		blueBall: [5, 10]
	},
	{
		index: '2025075',
		date: '2025-07-05',
		'销售额': '无公开数据',
		redBall: [8, 12, 16, 19, 35],
		blueBall: [6, 9]
	},
	{
		index: '2025076',
		date: '2025-07-07',
		'销售额': '无公开数据',
		redBall: [11, 18, 22, 25, 29],
		blueBall: [4, 12]
	},
	{
		index: '2025077',
		date: '2025-07-09',
		'销售额': '无公开数据',
		redBall: [12, 14, 16, 19, 28],
		blueBall: [1, 4]
	},
	{
		index: '2025078',
		date: '2025-07-12',
		'销售额': '无公开数据',
		redBall: [7, 10, 15, 21, 24],
		blueBall: [5, 6]
	},
	{
		index: '2025079',
		date: '2025-07-14',
		'销售额': '无公开数据',
		redBall: [2, 14, 32, 34, 35],
		blueBall: [5, 11]
	},
	{
		index: '2025080',
		date: '2025-07-16',
		'销售额': '299028201',
		redBall: [9, 10, 18, 22, 24],
		blueBall: [3, 12]
	},
	{
		index: '2025081',
		date: '2025-07-19',
		'销售额': '无公开数据',
		redBall: [1, 4, 6, 15, 18],
		blueBall: [2, 3]
	},
	{
		index: '2025082',
		date: '2025-07-21',
		'销售额': '无公开数据',
		redBall: [2, 3, 4, 12, 26],
		blueBall: [1, 8]
	},
	{
		index: '2025083',
		date: '2025-07-23',
		'销售额': '无公开数据',
		redBall: [12, 17, 18, 20, 34],
		blueBall: [2, 5]
	},
	{
		index: '2025084',
		date: '2025-07-26',
		'销售额': '无公开数据',
		redBall: [9, 11, 13, 18, 29],
		blueBall: [4, 11]
	},
	{
		index: '2025085',
		date: '2025-07-28',
		'销售额': '无公开数据',
		redBall: [2, 5, 9, 14, 33],
		blueBall: [4, 9]
	},
	{
		index: '2025086',
		date: '2025-07-30',
		'销售额': '无公开数据',
		redBall: [2, 6, 23, 24, 33],
		blueBall: [1, 10]
	},
	{
		index: '2025087',
		date: '2025-08-02',
		'销售额': '无公开数据',
		redBall: [5, 13, 14, 16, 20],
		blueBall: [3, 8]
	},
	{
		index: '2025088',
		date: '2025-08-04',
		'销售额': '无公开数据',
		redBall: [8, 9, 10, 11, 35],
		blueBall: [5, 11]
	},
	{
		index: '2025089',
		date: '2025-08-07',
		'销售额': '无公开数据',
		redBall: [2, 11, 12, 32, 34],
		blueBall: [3, 10]
	},
	{
		index: '2025090',
		date: '2025-08-09',
		'销售额': '无公开数据',
		redBall: [6, 14, 19, 22, 27],
		blueBall: [1, 4]
	},
	{
		index: '25091',
		date: '2025-08-11',
		redBall: [1, 19, 22, 25, 27],
		blueBall: [3, 10],
		'总投注额(元)': '307088100',
		'奖池奖金(元)': '1254338103.41',
		'中奖信息': {
			'一等奖': [Object],
			'二等奖': [Object]
		}
	},
	{
		index: '25092',
		date: '2025-08-13',
		redBall: [4, 10, 17, 25, 32],
		blueBall: [5, 7],
		'总投注额(元)': '305765437',
		'奖池奖金(元)': '1153953579',
		'中奖信息': {
			'一等奖': [Object],
			'二等奖': [Object]
		}
	},
	{
		index: '25093',
		date: '2025-08-16',
		redBall: [1, 7, 9, 16, 30],
		blueBall: [2, 5],
		'总投注额(元)': '330705608',
		'奖池奖金(元)': '1157754344.65',
		'中奖信息': {
			'一等奖': [Object],
			'二等奖': [Object]
		}
	},
	{
		index: '25094',
		date: '2025-08-18',
		redBall: [4, 8, 10, 13, 26],
		blueBall: [9, 10],
		'总投注额(元)': '0',
		'奖池奖金(元)': '0',
		'中奖信息': {
			'一等奖': [Object],
			'二等奖': [Object]
		}
	},
	{
		index: '25095',
		date: '2025-08-20',
		redBall: [1, 15, 22, 30, 31],
		blueBall: [2, 8],
		'总投注额(元)': '0',
		'奖池奖金(元)': '0',
		'中奖信息': {
			'一等奖': [Object],
			'二等奖': [Object]
		}
	},
	{
		index: '25096',
		date: '2025-08-23',
		redBall: [2, 9, 14, 21, 26],
		blueBall: [2, 12],
		'总投注额(元)': '0',
		'奖池奖金(元)': '0',
		'中奖信息': {
			'一等奖': [Object],
			'二等奖': [Object]
		}
	},
	{
		index: '25097',
		date: '2025-08-25',
		redBall: [3, 4, 21, 23, 24],
		blueBall: [9, 12],
		'总投注额(元)': '0',
		'奖池奖金(元)': '0',
		'中奖信息': {
			'一等奖': [Object],
			'二等奖': [Object]
		}
	},
	{
		index: '25098',
		date: '2025-08-27',
		redBall: [1, 14, 18, 28, 35],
		blueBall: [2, 3],
		'总投注额(元)': '0',
		'奖池奖金(元)': '0',
		'中奖信息': {
			'一等奖': [Object],
			'二等奖': [Object]
		}
	},
	{
		index: '25099',
		date: '2025-08-30',
		redBall: [3, 8, 9, 12, 16],
		blueBall: [1, 5],
		'总投注额(元)': '0',
		'奖池奖金(元)': '0',
		'中奖信息': {
			'一等奖': [Object],
			'二等奖': [Object]
		}
	},
	{
		index: '25100',
		date: '2025-09-01',
		redBall: [3, 12, 14, 21, 35],
		blueBall: [1, 5],
		'总投注额(元)': '0',
		'奖池奖金(元)': '0',
		'中奖信息': {
			'一等奖': [Object],
			'二等奖': [Object]
		}
	},
	{
		index: '25101',
		date: '2025-09-03',
		redBall: [2, 6, 16, 22, 29],
		blueBall: [8, 12],
		'总投注额(元)': '0',
		'奖池奖金(元)': '0'
	},
	{
		index: '25102',
		date: '2025-09-06',
		redBall: [5, 10, 18, 21, 29],
		blueBall: [5, 7],
		'总投注额(元)': '0',
		'奖池奖金(元)': '0'
	},
	{
		index: '25103',
		date: '2025-09-08',
		redBall: [2, 8, 9, 12, 21],
		blueBall: [4, 5],
		'总投注额(元)': '0',
		'奖池奖金(元)': '0'
	},
	{
		index: '25104',
		date: '2025-09-10',
		redBall: [8, 15, 27, 29, 31],
		blueBall: [1, 7],
		'总投注额(元)': '0',
		'奖池奖金(元)': '0'
	},
	{
		index: '25105',
		date: '2025-09-13',
		redBall: [11, 13, 22, 26, 35],
		blueBall: [2, 8],
		'总投注额(元)': '0',
		'奖池奖金(元)': '0'
	},
	{
		index: '25106',
		date: '2025-09-15',
		redBall: [2, 3, 8, 13, 21],
		blueBall: [7, 12],
		'总投注额(元)': '0',
		'奖池奖金(元)': '0'
	},
	{
		index: '25107',
		date: '2025-09-17',
		redBall: [2, 3, 6, 16, 17],
		blueBall: [4, 5],
		'总投注额(元)': '0',
		'奖池奖金(元)': '0'
	},
	{
		index: '25108',
		date: '2025 - 09 - 20',
		redBall: [14, 18, 21, 24, 29],
		blueBall: [3, 6],
		'销售额（元）': '341209503'
	},
	{
		index: '25109',
		date: '2025 - 09 - 22',
		redBall: [4, 8, 10, 13, 26],
		blueBall: [9, 10],
		'销售额（元）': '313350591'
	},
	{
		index: '25110',
		date: '2025 - 09 - 24',
		redBall: [1, 15, 22, 30, 31],
		blueBall: [2, 8],
		'销售额（元）': '299730589'
	},
	{
		index: '25111',
		date: '2025 - 09 - 27',
		redBall: [2, 9, 14, 21, 26],
		blueBall: [2, 12],
		'销售额（元）': '331165537'
	},
	{
		index: '25112',
		date: '2025 - 09 - 29',
		redBall: [3, 4, 21, 23, 24],
		blueBall: [9, 12],
		'销售额（元）': '319054991'
	},
	{
		index: '25113',
		date: '2025 - 10 - 06',
		redBall: [1, 14, 18, 28, 35],
		blueBall: [2, 3],
		'销售额（元）': '302539540'
	},
	{
		index: '25114',
		date: '2025 - 10 - 08',
		redBall: [3, 8, 9, 12, 16],
		blueBall: [1, 5],
		'销售额（元）': '286469363'
	},
	{
		index: '25115',
		date: '2025 - 10 - 11',
		redBall: [3, 12, 14, 21, 35],
		blueBall: [1, 5],
		'销售额（元）': '330363634'
	},
	{
		index: '25116',
		date: '2025 - 10 - 13',
		redBall: [2, 6, 16, 22, 29],
		blueBall: [8, 12],
		'销售额（元）': '298992508'
	},
	{
		index: '25117',
		date: '2025 - 10 - 15',
		redBall: [5, 10, 18, 21, 29],
		blueBall: [5, 7],
		'销售额（元）': '302232387'
	},
	{
		index: '25118',
		date: '2025 - 10 - 18',
		redBall: [2, 8, 9, 12, 21],
		blueBall: [4, 5],
		'销售额（元）': '319584678'
	},
	{
		index: '25119',
		date: '2025 - 10 - 20',
		redBall: [8, 15, 27, 29, 31],
		blueBall: [1, 7],
		'销售额（元）': '319880731'
	},
	{
		index: '25120',
		date: '2025 - 10 - 22',
		redBall: [11, 13, 22, 26, 35],
		blueBall: [2, 8],
		'销售额（元）': '325832725'
	},
	{
		index: '25121',
		date: '2025 - 10 - 25',
		redBall: [2, 3, 8, 13, 21],
		blueBall: [7, 12],
		'销售额（元）': '356833346'
	},
	{
		index: '25122',
		date: '2025 - 10 - 27',
		redBall: [2, 3, 6, 16, 17],
		blueBall: [4, 5],
		'销售额（元）': '332420638'
	},
	{
		index: '25123',
		date: '2025 - 10 - 29',
		redBall: [8, 13, 24, 25, 31],
		blueBall: [4, 10],
		'销售额（元）': '333755324'
	},
	{
		index: '25124',
		date: '2025 - 11 - 01',
		redBall: [6, 9, 14, 26, 27],
		blueBall: [8, 9],
		'销售额（元）': '367907521'
	},
	{
		index: '25125',
		date: '2025 - 11 - 03',
		redBall: [10, 11, 13, 19, 35],
		blueBall: [4, 11],
		'销售额（元）': '333554750'
	},
	{
		index: '25126',
		date: '2025 - 11 - 05',
		redBall: [1, 8, 18, 27, 30],
		blueBall: [6, 7],
		'销售额（元）': '333017418'
	},
	{
		index: '25127',
		date: '2025 - 11 - 08',
		redBall: [4, 5, 19, 28, 29],
		blueBall: [5, 8],
		'销售额（元）': '353038355'
	},
	{
		index: '25128',
		date: '2025 - 11 - 10',
		redBall: [3, 6, 26, 30, 33],
		blueBall: [11, 12],
		'销售额（元）': '335180121'
	},
	{
		index: '25129',
		date: '2025 - 11 - 12',
		redBall: [3, 9, 14, 28, 35],
		blueBall: [2, 4],
		'销售额（元）': '327577708'
	},
	{
		index: '25130',
		date: '2025 - 11 - 15',
		redBall: [1, 13, 16, 27, 29],
		blueBall: [2, 11],
		'销售额（元）': '347978820'
	},
	{
		index: '25131',
		date: '2025 - 11 - 17',
		redBall: [3, 8, 25, 29, 32],
		blueBall: [9, 12],
		'销售额（元）': '312224838'
	},
	{
		index: '25132',
		date: '2025 - 11 - 19',
		redBall: [1, 9, 10, 12, 19],
		blueBall: [6, 7],
		'销售额（元）': '313565367'
	},
	{
		index: '25133',
		date: '2025 - 11 - 22',
		redBall: [4, 11, 23, 27, 35],
		blueBall: [7, 11],
		'销售额（元）': '337536466'
	},
	{
		index: '25134',
		date: '2025 - 11 - 24',
		redBall: [7, 12, 18, 27, 33],
		blueBall: [9, 10],
		'销售额（元）': '311134788'
	},
	{
		index: '25135',
		date: '2025 - 11 - 26',
		redBall: [2, 10, 16, 28, 32],
		blueBall: [1, 7],
		'销售额（元）': '310594999'
	}


]
// let arr = [];
// for (let j = 0; j < dltHistory.length; j++) {
// 	let item = dltHistory[j];

// 	for (let i = 0; i < item.redBall.length; i++) {
// 		item.redBall[i] = parseInt(item.redBall[i]);
// 	}
// 	for (let i = 0; i < item.blueBall.length; i++) {
// 		item.blueBall[i] = parseInt(item.blueBall[i]);
// 	}
// }
// arr = dltHistory.slice(100);
// console.log(arr)
/**
 * 将2025年大乐透61到90期开奖结束整理成json格式，要全部开奖数据升序排列，生成附件
 */