export var  ssq_history =[
  {
    index: '2025001',
    date: '2025-01-02',
    redBall: [ 5, 8, 9, 10, 16, 21 ],
    blueBall: 5
  },
  {
    index: '2025002',
    date: '2025-01-05',
    redBall: [ 4, 9, 16, 17, 18, 31 ],
    blueBall: 7
  },
  {
    index: '2025003',
    date: '2025-01-07',
    redBall: [ 13, 16, 21, 25, 28, 31 ],
    blueBall: 16
  },
  {
    index: '2025004',
    date: '2025-01-09',
    redBall: [ 2, 5, 15, 16, 24, 32 ],
    blueBall: 16
  },
  {
    index: '2025005',
    date: '2025-01-12',
    redBall: [ 4, 7, 18, 24, 26, 28 ],
    blueBall: 8
  },
  {
    index: '2025006',
    date: '2025-01-14',
    redBall: [ 1, 7, 8, 17, 20, 22 ],
    blueBall: 6
  },
  {
    index: '2025007',
    date: '2025-01-16',
    redBall: [ 7, 8, 14, 18, 21, 27 ],
    blueBall: 11
  },
  {
    index: '2025008',
    date: '2025-01-19',
    redBall: [ 9, 14, 16, 17, 25, 33 ],
    blueBall: 11
  },
  {
    index: '2025009',
    date: '2025-01-21',
    redBall: [ 2, 4, 11, 12, 23, 25 ],
    blueBall: 6
  },
  {
    index: '2025010',
    date: '2025-01-23',
    redBall: [ 4, 6, 7, 16, 17, 21 ],
    blueBall: 8
  },
  {
    index: '2025011',
    date: '2025-01-26',
    redBall: [ 6, 13, 17, 22, 24, 29 ],
    blueBall: 11
  },
  {
    index: '2025012',
    date: '2025-01-28',
    redBall: [ 7, 11, 13, 18, 27, 31 ],
    blueBall: 11
  },
  {
    index: '2025013',
    date: '2025-01-30',
    redBall: [ 4, 14, 16, 23, 24, 30 ],
    blueBall: 14
  },
  {
    index: '2025014',
    date: '2025-02-02',
    redBall: [ 6, 7, 9, 13, 21, 27 ],
    blueBall: 5
  },
  {
    index: '2025015',
    date: '2025-02-04',
    redBall: [ 4, 11, 15, 24, 25, 33 ],
    blueBall: 15
  },
  {
    index: '2025016',
    date: '2025-02-06',
    redBall: [ 2, 3, 12, 16, 20, 29 ],
    blueBall: 14
  },
  {
    index: '2025017',
    date: '2025-02-09',
    redBall: [ 4, 12, 15, 18, 28, 29 ],
    blueBall: 5
  },
  {
    index: '2025018',
    date: '2025-02-11',
    redBall: [ 3, 9, 18, 21, 28, 29 ],
    blueBall: 11
  },
  {
    index: '2025019',
    date: '2025-02-13',
    redBall: [ 5, 13, 17, 18, 22, 23 ],
    blueBall: 11
  },
  {
    index: '2025020',
    date: '2025-02-16',
    redBall: [ 4, 11, 13, 16, 26, 30 ],
    blueBall: 15
  },
  {
    index: '2025021',
    date: '2025-02-18',
    redBall: [ 7, 8, 16, 18, 25, 32 ],
    blueBall: 14
  },
  {
    index: '2025022',
    date: '2025-02-20',
    redBall: [ 11, 17, 18, 20, 28, 30 ],
    blueBall: 10
  },
  {
    index: '2025023',
    date: '2025-02-23',
    redBall: [ 9, 12, 13, 24, 25, 33 ],
    blueBall: 7
  },
  {
    index: '2025024',
    date: '2025-02-25',
    redBall: [ 10, 11, 22, 27, 30, 32 ],
    blueBall: 15
  },
  {
    index: '2025025',
    date: '2025-02-27',
    redBall: [ 12, 15, 21, 23, 25, 30 ],
    blueBall: 2
  },
  {
    index: '2025026',
    date: '2025-03-02',
    redBall: [ 9, 10, 12, 14, 19, 32 ],
    blueBall: 7
  },
  {
    index: '2025027',
    date: '2025-03-04',
    redBall: [ 5, 7, 8, 15, 16, 23 ],
    blueBall: 6
  },
  {
    index: '2025028',
    date: '2025-03-06',
    redBall: [ 4, 9, 14, 15, 18, 25 ],
    blueBall: 15
  },
  {
    index: '2025029',
    date: '2025-03-09',
    redBall: [ 5, 15, 16, 25, 30, 33 ],
    blueBall: 16
  },
  {
    index: '2025030',
    date: '2025-03-11',
    redBall: [ 4, 6, 7, 30, 31, 33 ],
    blueBall: 6
  },
  {
    index: '2025031',
    date: '2025-03-13',
    redBall: [ 1, 5, 6, 8, 23, 28 ],
    blueBall: 1
  },
  {
    index: '2025032',
    date: '2025-03-16',
    redBall: [ 3, 8, 10, 14, 16, 21 ],
    blueBall: 3
  },
  {
    index: '2025033',
    date: '2025-03-18',
    redBall: [ 3, 5, 18, 25, 26, 33 ],
    blueBall: 8
  },
  {
    index: '2025034',
    date: '2025-03-20',
    redBall: [ 5, 8, 13, 14, 24, 26 ],
    blueBall: 12
  },
  {
    index: '2025035',
    date: '2025-03-23',
    redBall: [ 1, 8, 16, 18, 25, 31 ],
    blueBall: 1
  },
  {
    index: '2025036',
    date: '2025-03-25',
    redBall: [ 5, 11, 13, 16, 19, 32 ],
    blueBall: 7
  },
  {
    index: '2025037',
    date: '2025-03-27',
    redBall: [ 3, 6, 11, 20, 21, 31 ],
    blueBall: 2
  },
  {
    index: '2025038',
    date: '2025-03-30',
    redBall: [ 6, 19, 20, 23, 26, 33 ],
    blueBall: 9
  },
  {
    index: '2025039',
    date: '2025-04-01',
    redBall: [ 8, 10, 12, 15, 17, 23 ],
    blueBall: 11
  },
  {
    index: '2025040',
    date: '2025-04-03',
    redBall: [ 2, 6, 8, 9, 10, 24 ],
    blueBall: 11
  },
  {
    index: '2025041',
    date: '2025-04-06',
    redBall: [ 6, 10, 17, 19, 25, 31 ],
    blueBall: 6
  },
  {
    index: '2025042',
    date: '2025-04-08',
    redBall: [ 7, 13, 19, 23, 27, 33 ],
    blueBall: 12
  },
  {
    index: '2025043',
    date: '2025-04-10',
    redBall: [ 3, 12, 16, 19, 20, 32 ],
    blueBall: 13
  },
  {
    index: '2025044',
    date: '2025-04-13',
    redBall: [ 2, 3, 7, 8, 14, 28 ],
    blueBall: 11
  },
  {
    index: '2025045',
    date: '2025-04-15',
    redBall: [ 2, 14, 19, 24, 29, 33 ],
    blueBall: 13
  },
  {
    index: '2025046',
    date: '2025-04-17',
    redBall: [ 2, 3, 10, 16, 29, 33 ],
    blueBall: 1
  },
  {
    index: '2025047',
    date: '2025-04-20',
    redBall: [ 1, 14, 21, 22, 23, 31 ],
    blueBall: 12
  },
  {
    index: '2025048',
    date: '2025-04-22',
    redBall: [ 16, 21, 22, 23, 27, 31 ],
    blueBall: 10
  },
  {
    index: '2025049',
    date: '2025-04-24',
    redBall: [ 3, 6, 19, 27, 29, 33 ],
    blueBall: 11
  },
  {
    index: '2025050',
    date: '2025-04-27',
    redBall: [ 9, 12, 15, 18, 22, 33 ],
    blueBall: 11
  },
  {
    index: '2025051',
    date: '2025 - 05 - 08',
    redBall: [ 1, 2, 3, 4, 17, 22 ],
    blueBall: 1
  },
  {
    index: '2025052',
    date: '2025 - 05 - 11',
    redBall: [ 6, 7, 10, 17, 20, 26 ],
    blueBall: 9
  },
  {
    index: '2025053',
    date: '2025 - 05 - 13',
    redBall: [ 6, 9, 10, 13, 30, 33 ],
    blueBall: 7
  },
  {
    index: '2025054',
    date: '2025 - 05 - 15',
    redBall: [ 5, 7, 10, 21, 24, 27 ],
    blueBall: 16
  },
  {
    index: '2025055',
    date: '2025 - 05 - 18',
    redBall: [ 2, 5, 22, 27, 29, 33 ],
    blueBall: 12,
    '一等奖注数': 3,
    '一等奖单注奖金（元）': 10000000,
    '奖池金额（元）': 2277000000
  },
  {
    index: '2025056',
    date: '2025 - 05 - 20',
    redBall: [ 1, 2, 10, 14, 28, 31 ],
    blueBall: 3,
    '一等奖注数': 7,
    '一等奖单注奖金（元）': 7790128,
    '奖池金额（元）': 2296000000
  },
  {
    index: '2025057',
    date: '2025 - 05 - 22',
    redBall: [ 4, 9, 15, 16, 25, 30 ],
    blueBall: 14,
    '一等奖注数': 22,
    '一等奖单注奖金（元）': 5810000,
    '奖池金额（元）': 2235000000
  },
  {
    index: '2025058',
    date: '2025 - 05 - 25',
    redBall: [ 2, 6, 7, 9, 10, 20 ],
    blueBall: 6,
    '一等奖注数': 10,
    '一等奖单注奖金（元）': 6750000,
    '奖池金额（元）': 2233000000
  },
  {
    index: '2025059',
    date: '2025 - 05 - 25',
    redBall: [ 4, 10, 11, 12, 13, 24 ],
    blueBall: 1,
    '一等奖注数': 4,
    '一等奖单注奖金（元）': 6750000,
    '奖池金额（元）': 2233000000
  },
  {
    index: '2025060',
    date: '2025 - 05 - 29',
    redBall: [ 6, 14, 18, 25, 28, 30 ],
    blueBall: 1,
    '一等奖注数': 2,
    '一等奖单注奖金（元）': 10000000,
    '奖池金额（元）': 2329000000
  },
  {
    index: '2025061',
    date: '2025 - 06 - 01',
    redBall: [ 6, 7, 9, 10, 11, 32 ],
    blueBall: 9,
    '一等奖注数': 6,
    '一等奖单注奖金（元）': 7568637,
    '奖池金额（元）': 2341000000
  },
  {
    index: '2025062',
    date: '2025 - 06 - 03',
    redBall: [ 6, 8, 9, 13, 25, 31 ],
    blueBall: 14,
    '一等奖注数': 6,
    '一等奖单注奖金（元）': 8340000,
    '奖池金额（元）': 2367000000
  },
  {
    index: '2025063',
    date: '2025 - 06 - 05',
    redBall: [ 2, 19, 21, 22, 28, 30 ],
    blueBall: 1,
    '一等奖注数': 12,
    '一等奖单注奖金（元）': 7110000,
    '奖池金额（元）': 2377000000
  },
  {
    index: '2025064',
    date: '2025 - 06 - 08',
    redBall: [ 2, 10, 13, 22, 29, 33 ],
    blueBall: 16,
    '一等奖注数': 10,
    '一等奖单注奖金（元）': 7200000,
    '奖池金额（元）': 2388000000
  },
  {
    index: '2025065',
    date: '2025 - 06 - 10',
    redBall: [ 6, 10, 13, 14, 15, 20 ],
    blueBall: 11,
    '一等奖注数': 4,
    '一等奖单注奖金（元）': 8851267,
    '奖池金额（元）': ''
  },
  {
    index: '2025066',
    date: '2025 - 06 - 12',
    redBall: [ 6, 22, 24, 27, 28, 30 ],
    blueBall: 4,
    '一等奖注数': 10,
    '一等奖单注奖金（元）': 6441022,
    '奖池金额（元）': ''
  },
  {
    index: '2025067',
    date: '2025 - 06 - 15',
    redBall: [ 1, 5, 10, 17, 20, 22 ],
    blueBall: 5,
    '一等奖注数': 13,
    '一等奖单注奖金（元）': 6200625,
    '奖池金额（元）': ''
  },
  {
    index: '2025068',
    date: '2025 - 06 - 17',
    redBall: [ 5, 7, 8, 19, 20, 31 ],
    blueBall: 7,
    '一等奖注数': 24,
    '一等奖单注奖金（元）': 5500300,
    '奖池金额（元）': 2290000000
  },
  {
    index: '2025069',
    date: '2025 - 06 - 19',
    redBall: [ 2, 4, 19, 23, 27, 30 ],
    blueBall: 5,
    '一等奖注数': 3,
    '一等奖单注奖金（元）': 10000000,
    '奖池金额（元）': 2342000000
  },
  {
    index: '2025070',
    date: '2025 - 06 - 22',
    redBall: [ 2, 3, 15, 21, 22, 33 ],
    blueBall: 6,
    '一等奖注数': 5,
    '一等奖单注奖金（元）': 8940000,
    '奖池金额（元）': 2371000000
  },
  {
    index: '2025071',
    date: '2025 - 06 - 24',
    redBall: [ 1, 12, 18, 23, 25, 28 ],
    blueBall: 7,
    '一等奖注数': 3,
    '一等奖单注奖金（元）': 10000000,
    '奖池金额（元）': 2406000000
  },
  {
    index: '2025072',
    date: '2025 - 06 - 26',
    redBall: [ 2, 14, 17, 25, 27, 29 ],
    blueBall: 5,
    '一等奖注数': 8,
    '一等奖单注奖金（元）': 7489467,
    '奖池金额（元）': ''
  },
  {
    index: '2025073',
    date: '2025 - 06 - 29',
    redBall: [ 2, 7, 10, 27, 30, 33 ],
    blueBall: 11,
    '一等奖注数': 19,
    '一等奖单注奖金（元）': 5910000,
    '奖池金额（元）': 2374000000
  },
  {
    index: '2025074',
    date: '2025 - 07 - 01',
    redBall: [3,4,12,20,32,33],
    blueBall: [13],
    '一等奖注数': '',
    '一等奖单注奖金（元）': '',
    '奖池金额（元）': ''
  },
  {
    index: '2025075',
    date: '2025 - 07 - 03',
    redBall: [ 10, 12, 14, 19, 20, 21 ],
    blueBall: 15,
    '一等奖注数': 12,
    '一等奖单注奖金（元）': 6290000,
    '奖池金额（元）': 2390000000
  },
  {
    index: '2025076',
    date: '2025 - 07 - 06',
    redBall: [ 2, 6, 9, 12, 14, 30 ],
    blueBall: 8,
    '一等奖注数': 4,
    '一等奖单注奖金（元）': 7400000,
    '奖池金额（元）': 2396000000
  },
  {
    index: '2025077',
    date: '2025 - 07 - 08',
    redBall: [ 4, 7, 8, 15, 20, 21 ],
    blueBall: 15,
    '一等奖注数': 9,
    '一等奖单注奖金（元）': 7448353,
    '奖池金额（元）': ''
  },
  {
    index: '2025078',
    date: '2025 - 07 - 10',
    redBall: [ 6, 15, 17, 30, 32, 33 ],
    blueBall: 14,
    '一等奖注数': 0,
    '一等奖单注奖金（元）': 0,
    '奖池金额（元）': 2491000000
  },
  {
    index: '2025079',
    date: '2025 - 07 - 12',
    redBall: [8,11,14,15,30,32],
    blueBall: [5],
    '一等奖注数': '',
    '一等奖单注奖金（元）': '',
    '奖池金额（元）': ''
  },
  {
    index: '2025080',
    date: '2025 - 07 - 14',
    redBall: [3,7,8,10,16,19],
    blueBall: [5],
    '一等奖注数': '',
    '一等奖单注奖金（元）': '',
    '奖池金额（元）': ''
  },
  {
    index: '2025081',
    date: '2025 - 07 - 17',
    redBall: [3,6,18,20,23,28],
    blueBall: [5],
    '一等奖注数': 6,
    '一等奖单注奖金（元）': 8410000,
    '奖池金额（元）': 2529000000
  },
  {
    index: '2025082',
    date: '2025 - 07 - 20',
    redBall: [ 4, 6, 9, 14, 32, 33 ],
    blueBall: 11,
    '一等奖注数': 4,
    '一等奖单注奖金（元）': 9500000,
    '奖池金额（元）': 2558000000
  },
  {
    index: '2025083',
    date: '2025 - 07 - 22',
    redBall: [10,15,16,17,27,29],
    blueBall: [12],
    '一等奖注数': 8,
    '一等奖单注奖金（元）': 7100000,
    '奖池金额（元）': 2565000000
  },
  {
    index: '2025084',
    date: '2025 - 07 - 24',
    redBall: [ 6, 8, 10, 14, 24, 33 ],
    blueBall: 15,
    '一等奖注数': 6,
    '一等奖单注奖金（元）': 8609555,
    '奖池金额（元）': 2594000000
  },
  {
    index: '2025085',
    date: '2025 - 07 - 27',
    redBall: [ 11, 14, 15, 18, 21, 24 ],
    blueBall: 13,
    '一等奖注数': 17,
    '一等奖单注奖金（元）': 6330000,
    '奖池金额（元）': 2572000000
  },
  {
    index: '2025086',
    date: '2025 - 07 - 29',
    redBall: [ 2, 6, 8, 10, 17, 24 ],
    blueBall: 6,
    '一等奖注数': 16,
    '一等奖单注奖金（元）': 5994098,
    '奖池金额（元）': 2535000000
  },
  {
    index: '2025087',
    date: '2025 - 07 - 31',
    redBall: [ 2, 6, 14, 15, 24, 26 ],
    blueBall: 8
  },
  {
    index: '2025088',
    date: '2025 - 08 - 03',
    redBall: [ 1, 3, 13, 18, 21, 25 ],
    blueBall: 6
  },
  {
    index: '2025089',
    date: '2025 - 08 - 05',
    redBall: [ 4, 6, 8, 18, 31, 33 ],
    blueBall: 5
  },
  {
    index: '2025090',
    date: '2025 - 08 - 07',
    redBall: [ 6, 11, 12, 21, 27, 28 ],
    blueBall: 15
  },
  {
    index: '2025091',
    date: '2025 - 08 - 10',
    redBall: [ 3, 4, 17, 19, 25, 27 ],
    blueBall: 14
  },
  {
    index: '2025092',
    date: '2025 - 08 - 12',
    redBall: [ 2, 11, 14, 17, 23, 24 ],
    blueBall: 12
  },
  {
    index: '2025093',
    date: '2025 - 08 - 14',
    redBall: [ 9, 11, 12, 24, 25, 26 ],
    blueBall: 10
  },
  {
    index: '2025094',
    date: '2025 - 08 - 17',
    redBall: [ 11, 13, 17, 19, 23, 29 ],
    blueBall: 16
  },
  {
    index: '2025095',
    date: '2025 - 08 - 19',
    redBall: [ 15, 16, 22, 23, 26, 32 ],
    blueBall: 4
  },
  {
    index: '2025096',
    date: '2025 - 08 - 21',
    redBall: [ 7, 9, 11, 12, 16, 29 ],
    blueBall: 15
  },
  {
    index: '2025097',
    date: '2025 - 08 - 24',
    redBall: [ 3, 5, 16, 23, 26, 31 ],
    blueBall: 14
  },
  {
    index: '2025098',
    date: '2025 - 08 - 26',
    redBall: [ 5, 8, 13, 17, 18, 29 ],
    blueBall: 2
  },
  {
    index: '2025099',
    date: '2025 - 08 - 28',
    redBall: [ 9, 11, 15, 17, 22, 26 ],
    blueBall: 14
  },
  {
    index: '2025100',
    date: '2025 - 08 - 31',
    redBall: [ 12, 16, 17, 25, 30, 31 ],
    blueBall: 16
  },
 {
     index: '2025101',
     date: '2025 - 09 - 02',
     redBall: [ 5, 8, 9, 10, 16, 21 ],
     blueBall: 5
   },
   {
     index: '2025102',
     date: '2025 - 09 - 04',
     redBall: [ 4, 9, 16, 17, 18, 31 ],
     blueBall: 7
   },
   {
     index: '2025103',
     date: '2025 - 09 - 07',
     redBall: [ 13, 16, 21, 25, 28, 31 ],
     blueBall: 16
   },
   {
     index: '2025104',
     date: '2025 - 09 - 09',
     redBall: [ 2, 5, 15, 16, 24, 32 ],
     blueBall: 16
   },
   {
     index: '2025105',
     date: '2025 - 09 - 11',
     redBall: [ 4, 7, 18, 24, 26, 28 ],
     blueBall: 8
   },
   {
     index: '2025106',
     date: '2025 - 09 - 14',
     redBall: [ 4, 5, 17, 22, 26, 30 ],
     blueBall: 4
   },
   {
     index: '2025107',
     date: '2025 - 09 - 16',
     redBall: [ 2, 3, 10, 15, 25, 33 ],
     blueBall: 13
   },
   {
     index: '2025108',
     date: '2025 - 09 - 18',
     redBall: [ 1, 9, 14, 17, 22, 33 ],
     blueBall: 7
   },
   {
     index: '2025109',
     date: '2025 - 09 - 21',
     redBall: [ 5, 6, 9, 17, 18, 31 ],
     blueBall: 3
   },
   {
     index: '2025110',
     date: '2025 - 09 - 23',
     redBall: [ 1, 5, 11, 14, 16, 19 ],
     blueBall: 8
   },
   {
     index: '2025111',
     date: '2025 - 09 - 25',
     redBall: [ 9, 14, 18, 28, 31, 33 ],
     blueBall: 12
   },
   {
     index: '2025112',
     date: '2025 - 09 - 28',
     redBall: [ 3, 9, 11, 13, 20, 32 ],
     blueBall: 2
   },
   {
     index: '2025113',
     date: '2025 - 09 - 30',
     redBall: [ 8, 10, 13, 15, 24, 31 ],
     blueBall: 16
   },
   {
     index: '2025114',
     date: '2025 - 10 - 05',
     redBall: [ 1, 20, 21, 25, 26, 27 ],
     blueBall: 10
   },
   {
     index: '2025115',
     date: '2025 - 10 - 07',
     redBall: [ 2, 3, 8, 19, 24, 30 ],
     blueBall: 2
   },
   {
     index: '2025116',
     date: '2025 - 10 - 09',
     redBall: [ 2, 4, 8, 24, 28, 31 ],
     blueBall: 9
   },
   {
     index: '2025117',
     date: '2025 - 10 - 12',
     redBall: [ 6, 8, 17, 20, 25, 33 ],
     blueBall: 10
   },
   {
     index: '2025118',
     date: '2025 - 10 - 14',
     redBall: [ 1, 10, 11, 16, 24, 26 ],
     blueBall: 3
   },
   {
     index: '2025119',
     date: '2025 - 10 - 16',
     redBall: [ 6, 9, 23, 26, 28, 32 ],
     blueBall: 11
   },
   {
     index: '2025120',
     date: '2025 - 10 - 19',
     redBall: [ 1, 2, 4, 7, 13, 32 ],
     blueBall: 7
   },
   {
     index: '2025121',
     date: '2025 - 10 - 21',
     redBall: [ 6, 8, 10, 25, 29, 30 ],
     blueBall: 8
   },
   {
     index: '2025122',
     date: '2025 - 10 - 23',
     redBall: [ 16, 18, 19, 20, 25, 31 ],
     blueBall: 13
   },
   {
     index: '2025123',
     date: '2025 - 10 - 26',
     redBall: [ 7, 9, 23, 24, 25, 26 ],
     blueBall: 10
   },
   {
     index: '2025124',
     date: '2025 - 10 - 28',
     redBall: [ 1, 2, 18, 19, 21, 33 ],
     blueBall: 13
   },
   {
     index: '2025125',
     date: '2025 - 10 - 30',
     redBall: [ 3, 9, 12, 13, 26, 32 ],
     blueBall: 9
   },
   {
     index: '2025126',
     date: '2025 - 11 - 02',
     redBall: [ 2, 12, 13, 16, 19, 25 ],
     blueBall: 10
   },
   {
     index: '2025127',
     date: '2025 - 11 - 04',
     redBall: [ 3, 9, 15, 17, 19, 28 ],
     blueBall: 3
   },
   {
     index: '2025128',
     date: '2025 - 11 - 06',
     redBall: [ 2, 10, 18, 19, 24, 27 ],
     blueBall: 1
   },
   {
     index: '2025129',
     date: '2025 - 11 - 09',
     redBall: [ 3, 4, 7, 13, 20, 30 ],
     blueBall: 3
   },
   {
     index: '2025130',
     date: '2025 - 11 - 11',
     redBall: [ 1, 5, 8, 14, 19, 23 ],
     blueBall: 6
   },
   {
     index: '2025131',
     date: '2025 - 11 - 13',
     redBall: [ 3, 13, 14, 18, 24, 31 ],
     blueBall: 3
   },
   {
     index: '2025132',
     date: '2025 - 11 - 16',
     redBall: [ 4, 8, 10, 21, 23, 32 ],
     blueBall: 11
   },
   {
     index: '2025133',
     date: '2025 - 11 - 18',
     redBall: [ 5, 14, 17, 19, 20, 33 ],
     blueBall: 7
   },
   {
     index: '2025134',
     date: '2025 - 11 - 20',
     redBall: [ 3, 5, 9, 13, 26, 29 ],
     blueBall: 12
   },
   {
     index: '2025135',
     date: '2025 - 11 - 23',
     redBall: [ 1, 2, 5, 9, 25, 32 ],
     blueBall: 10
   },
   {
     index: '2025136',
     date: '2025 - 11 - 25',
     redBall: [ 8, 10, 14, 23, 28, 32 ],
     blueBall: 12
   },
   {
     index: '2025137',
     date: '2025 - 11 - 27',
     redBall: [ 2, 8, 11, 23, 27, 29 ],
     blueBall: 5
   }
]

// for(item of data){

// 	item.blueBall=parseInt(item.blueBall);
// 	for(let i =0;i< item.redBall.length;i++){
// 		item.redBall[i]=parseInt(item.redBall[i]);
// 	}
// }
// console.log(data)